In [1]:
import streamlit as st  # pip install streamlit
import pandas as pd  # pip install pandas
import plotly.express as px  # pip install plotly-express

# https://www.youtube.com/watch?v=zmdjNSmRXF4&t=98s - relevant video

In [2]:
df = pd.read_excel('data/data.xlsx')
# How to display all columns or set number
# pd.set_option('display.max_columns', 15)
# pd.set_option('display.max_rows', 700)

In [3]:
# pint out data frame
df[['Position', 'First_Name']].value_counts()

# Display top or bottom x row
# df.head(10)
# df.tail(10)
# df['Position'] - a column
# df[['Position', 'First_Name']]

Position  First_Name
24        Jonathan      2
8         Andy          2
3         Lewis         2
124       Claire        2
102       Gita          1
                       ..
37        Thomas        1
38        Fiona         1
          Lukasz        1
          Natasha       1
213       Jennifer      1
Length: 688, dtype: int64

In [4]:
# display information on dataframe

# df.info()
# df.columns - Display Column Header

In [5]:
# .iloc is for intger only - only use integer
#df.loc[[0, 1]]

# .loc - You can use LABLES
# df.loc[[0, 1], ['First_Name', 'Surname']]

# count the indicidual values in the dataframe
# df[['Position', 'First_Name']].value_counts()

# List a number of columns and rows
df.loc[0:5, 'Surname':'Finish' ]

    Surname  Gender Category                       Club     Start    Finish
0  Paterson    Male   Senior                        NaN  09:45:00  10:24:41
1   Dhillon    Male   Senior                        NaN  09:45:00  10:25:48
2    Ramsay    Male      40s                        NaN  09:45:00  10:26:17
3    Macrae    Male      40s                        NaN  09:45:00  10:26:19
4   Maciver    Male   Senior  Carnethy Hill Racing Club  09:45:00  10:28:10
5    Duncan  Female   Senior               Race Fitness  09:45:00  10:28:31

In [7]:
df_select = df.loc[0:3, 'Position':'Finish']

df_select

,Position,Number,First_Name,Surname,Gender,Category,Club,Start,Finish
0,1,235,Stuart,Paterson,Male,Senior,NaN,09:45:00,10:24:41
1,2,285,Niku,Dhillon,Male,Senior,NaN,09:45:00,10:25:48
2,3,289,Allan,Ramsay,Male,40s,NaN,09:45:00,10:26:17
3,4,129,Andrew,Macrae,Male,40s,NaN,09:45:00,10:26:19